testCases/04_CFD-DEM/02_glitters_and_impeller_parallel/Allrun
#!/bin/sh
. $WM_PROJECT_DIR/bin/tools/RunFunctions

rm -rf 0

cp -r 0.org 0

paraFoam -touch
paraFoam -builtin -touch

runApplication blockMesh
runApplication decomposePar -force
application=`getApplication`

# runApplication $application
runParallel $application

# ----------------------------------------------------------------- end-of-file
